# Contents
 - Column Names
 - ...

# # Column Names
#### Ref. 
 - https://towardsdatascience.com/renaming-columns-in-a-pandas-dataframe-1d909360ddc6

#### Define DataFrame

In [44]:
import pandas as pd
df = pd.DataFrame({
    'ID' : [1, 2],
    'Col 1' : [3, 4],
    'CoL 2' : [5, 6]
})
df

   ID  Col 1  CoL 2
0   1      3      5
1   2      4      6

#### 0.

In [45]:
df.columns = df.columns.str.replace(' ', '_')
df

   ID  Col_1  CoL_2
0   1      3      5
1   2      4      6

#### 1.

In [46]:
df.rename(columns=str.lower).head()

   id  col_1  col_2
0   1      3      5
1   2      4      6

#### 2.

In [47]:
df.rename(columns=lambda col: col.lower())

   id  col_1  col_2
0   1      3      5
1   2      4      6

#### 3.

In [48]:
def remove_space(s):
    s = s.replace('1','one').replace('2','two')
    return s.replace(' ', '_').upper()
    # s.lower(), s.upper(), and so on...

df.rename(columns = remove_space, inplace=True)
df

   ID  COL_ONE  COL_TWO
0   1        3        5
1   2        4        6

#### 4.

In [49]:
df.rename(str.lower, axis=1)

   id  col_one  col_two
0   1        3        5
1   2        4        6

#### 5.

In [50]:
df.set_axis(['id_2', 'col_one_2', 'col_two_2'], axis=1)

   id_2  col_one_2  col_two_2
0     1          3          5
1     2          4          6

#### 6.

In [51]:
df.to_csv('cols.csv', index=False)

In [52]:
new_col_names = ['no', 'first', 'second']
df = pd.read_csv('./cols.csv', 
                 names = new_col_names,
                 header=0,       # drop existing header rows 
                 usecols=[0,2]   # read 0-index column and 2-index column
)   
df

   no  second
0   1       5
1   2       6

#### +a) Row names?!

In [53]:
df.set_axis(['row_1', 'row_2'], axis=0)

       no  second
row_1   1       5
row_2   2       6